#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[33mRunning plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/bradlewis/weather-app-infra/runs/run-xHSLNj3yxs2Z1akB[0m
[0m
Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_db_parameter_group.example_mysql[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_db_parameter_group" "example_mysql" {
      [32m+[0m [0m[1m[0marn[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m = "weather-app-aurora-db-mysql-parameter-group"
      [32m+[0m [0m[1m[0mfamily[0m[0m      = "aurora-mysql5.7"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "weather-app-aurora-db-mysql-parameter-group"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m    = (known after apply)
    }

[1m  # aws_rds_cluster_parameter_group.example_mysql[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_rds_cluster_parameter_group" "example_mysql" {
      [32m+[0m [0m[1m[0marn[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m = "weather-app-aurora-mysql-cluster-parameter-group"
      [32m+[0m [0m[1m[0mfamily[0m[0m      = "aurora-mysql5.7"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "weather-app-aurora-mysql-cluster-parameter-group"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m    = (known after apply)
    }

[1m  # module.weather_app_aurora_mysql.aws_db_subnet_group.this[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_db_subnet_group" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m = "For Aurora cluster weather-app-mysql"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "weather-app-mysql"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_ids[0m[0m  = [
          [32m+[0m [0m"subnet-0e2dbc68",
          [32m+[0m [0m"subnet-2128086c",
          [32m+[0m [0m"subnet-9167c3a0",
          [32m+[0m [0m"subnet-b0ab3491",
          [32m+[0m [0m"subnet-b81953b6",
          [32m+[0m [0m"subnet-dcf66b83",
        ]
      [32m+[0m [0m[1m[0mtags[0m[0m        = {
          [32m+[0m [0m"Name" = "aurora-weather-app-mysql"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m    = {
          [32m+[0m [0m"Name" = "aurora-weather-app-mysql"
        }
    }

[1m  # module.weather_app_aurora_mysql.aws_iam_role.rds_enhanced_monitoring[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "rds_enhanced_monitoring" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "monitoring.rds.amazonaws.com"
                        }
                      [32m+[0m [0mSid       = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "rds-enhanced-monitoring-weather-app-mysql"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0mtags[0m[0m                  = {
          [32m+[0m [0m"Name" = "aurora-weather-app-mysql"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m              = {
          [32m+[0m [0m"Name" = "aurora-weather-app-mysql"
        }
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # module.weather_app_aurora_mysql.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "rds_enhanced_monitoring" {
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy_arn[0m[0m = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      [32m+[0m [0m[1m[0mrole[0m[0m       = "rds-enhanced-monitoring-weather-app-mysql"
    }

[1m  # module.weather_app_aurora_mysql.aws_rds_cluster.this[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_rds_cluster" "this" {
      [32m+[0m [0m[1m[0mallocated_storage[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mallow_major_version_upgrade[0m[0m         = false
      [32m+[0m [0m[1m[0mapply_immediately[0m[0m                   = true
      [32m+[0m [0m[1m[0marn[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zones[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mbacktrack_window[0m[0m                    = 0
      [32m+[0m [0m[1m[0mbackup_retention_period[0m[0m             = 7
      [32m+[0m [0m[1m[0mcluster_identifier[0m[0m                  = "weather-app-mysql"
      [32m+[0m [0m[1m[0mcluster_identifier_prefix[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mcluster_members[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mcluster_resource_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mcopy_tags_to_snapshot[0m[0m               = false
      [32m+[0m [0m[1m[0mdatabase_name[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mdb_cluster_parameter_group_name[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mdb_subnet_group_name[0m[0m                = "weather-app-mysql"
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m                 = false
      [32m+[0m [0m[1m[0menable_global_write_forwarding[0m[0m      = false
      [32m+[0m [0m[1m[0menable_http_endpoint[0m[0m                = false
      [32m+[0m [0m[1m[0mendpoint[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mengine[0m[0m                              = "aurora-mysql"
      [32m+[0m [0m[1m[0mengine_mode[0m[0m                         = "serverless"
      [32m+[0m [0m[1m[0mengine_version[0m[0m                      = "5.6.10a"
      [32m+[0m [0m[1m[0mengine_version_actual[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mfinal_snapshot_identifier[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mglobal_cluster_identifier[0m[0m           = ""
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0miam_database_authentication_enabled[0m[0m = false
      [32m+[0m [0m[1m[0miam_roles[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mmaster_password[0m[0m                     = (sensitive value)
      [32m+[0m [0m[1m[0mmaster_username[0m[0m                     = "root"
      [32m+[0m [0m[1m[0mport[0m[0m                                = 3306
      [32m+[0m [0m[1m[0mpreferred_backup_window[0m[0m             = "02:00-03:00"
      [32m+[0m [0m[1m[0mpreferred_maintenance_window[0m[0m        = "sun:05:00-sun:06:00"
      [32m+[0m [0m[1m[0mreader_endpoint[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mreplication_source_identifier[0m[0m       = ""
      [32m+[0m [0m[1m[0mskip_final_snapshot[0m[0m                 = true
      [32m+[0m [0m[1m[0msnapshot_identifier[0m[0m                 = ""
      [32m+[0m [0m[1m[0msource_region[0m[0m                       = ""
      [32m+[0m [0m[1m[0mstorage_encrypted[0m[0m                   = true
      [32m+[0m [0m[1m[0mtags_all[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m              = (known after apply)

      [32m+[0m [0mscaling_configuration {
          [32m+[0m [0m[1m[0mauto_pause[0m[0m               = true
          [32m+[0m [0m[1m[0mmax_capacity[0m[0m             = 2
          [32m+[0m [0m[1m[0mmin_capacity[0m[0m             = 1
          [32m+[0m [0m[1m[0mseconds_until_auto_pause[0m[0m = 300
          [32m+[0m [0m[1m[0mtimeout_action[0m[0m           = "ForceApplyCapacityChange"
        }
    }

[1m  # module.weather_app_aurora_mysql.aws_rds_cluster_instance.this[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_rds_cluster_instance" "this" {
      [32m+[0m [0m[1m[0mapply_immediately[0m[0m                     = true
      [32m+[0m [0m[1m[0marn[0m[0m                                   = (known after apply)
      [32m+[0m [0m[1m[0mauto_minor_version_upgrade[0m[0m            = true
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mca_cert_identifier[0m[0m                    = "rds-ca-2019"
      [32m+[0m [0m[1m[0mcluster_identifier[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcopy_tags_to_snapshot[0m[0m                 = false
      [32m+[0m [0m[1m[0mdb_parameter_group_name[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mdb_subnet_group_name[0m[0m                  = "weather-app-mysql"
      [32m+[0m [0m[1m[0mdbi_resource_id[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mendpoint[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mengine[0m[0m                                = "aurora-mysql"
      [32m+[0m [0m[1m[0mengine_version[0m[0m                        = "5.6.10a"
      [32m+[0m [0m[1m[0mengine_version_actual[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                    = (known after apply)
      [32m+[0m [0m[1m[0midentifier[0m[0m                            = "weather-app-mysql-1"
      [32m+[0m [0m[1m[0midentifier_prefix[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mmonitoring_interval[0m[0m                   = 60
      [32m+[0m [0m[1m[0mmonitoring_role_arn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mperformance_insights_enabled[0m[0m          = false
      [32m+[0m [0m[1m[0mperformance_insights_kms_key_id[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mperformance_insights_retention_period[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mport[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0mpreferred_backup_window[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mpreferred_maintenance_window[0m[0m          = "sun:05:00-sun:06:00"
      [32m+[0m [0m[1m[0mpromotion_tier[0m[0m                        = 1
      [32m+[0m [0m[1m[0mpublicly_accessible[0m[0m                   = false
      [32m+[0m [0m[1m[0mstorage_encrypted[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mwriter[0m[0m                                = (known after apply)
    }

[1m  # module.weather_app_aurora_mysql.aws_security_group.this[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "Managed by Terraform"
      [32m+[0m [0m[1m[0megress[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname_prefix[0m[0m            = "weather-app-mysql-"
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Name" = "aurora-weather-app-mysql"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Name" = "aurora-weather-app-mysql"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = "vpc-ee52ff93"
    }

[1m  # module.weather_app_aurora_mysql.random_id.snapshot_identifier[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_id" "snapshot_identifier" {
      [32m+[0m [0m[1m[0mb64_std[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mb64_url[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mbyte_length[0m[0m = 4
      [32m+[0m [0m[1m[0mdec[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mhex[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mkeepers[0m[0m     = {
          [32m+[0m [0m"id" = "weather-app-mysql"
        }
    }

[1m  # module.weather_app_aurora_mysql.random_password.master_password[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_password" "master_password" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m      = 10
      [32m+[0m [0m[1m[0mlower[0m[0m       = true
      [32m+[0m [0m[1m[0mmin_lower[0m[0m   = 0
      [32m+[0m [0m[1m[0mmin_numeric[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_special[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_upper[0m[0m   = 0
      [32m+[0m [0m[1m[0mnumber[0m[0m      = true
      [32m+[0m [0m[1m[0mresult[0m[0m      = (sensitive value)
      [32m+[0m [0m[1m[0mspecial[0m[0m     = false
      [32m+[0m [0m[1m[0mupper[0m[0m       = true
    }

[0m[1mPlan:[0m 10 to add, 0 to change, 0 to destroy.
[0m

```

</details>

*Pusher: @BradLewis, Action: `pull_request`*